<?php
namespace base;

class Errcode
{
    // 配置参数
    public $errcode = array(
        //公用参数
        -1     => "失败",
        -20001 => "参数错误",
        -20002 => "时间格式不对",
        //用户相关
        -10001 => "用户未登录，请先登录",
        -10002 => "用户余额不足",
        -10003 => "用户信息不存在",
        //订单相关
        -30001 => "未指定订单店铺",
        -30002 => "订单信息不能为空",
        -30003 => "订单金额错误",
        -30004 => "请选择订单支付方式",
        -30005 => "订单类型错误",
        -30006 => "请选择配送时间",
        -30007 => "配送时间格式不对",
        -30008 => "请选择配送地址",
        -30009 => "请选择就餐人数",
        -30010 => "请选择预计就餐开始时间",
        -30011 => "就餐时间格式不对",
        -30012 => "请选择预计就餐结束时间",
        -30013 => "就餐时间格式不对",
        -30014 => "用户信息不存在",
        -30015 => "店铺信息不存在",
        -30016 => "订单总金额不正确",
        -30017 => "订单金额不正确",
        -30018 => "地址信息不存在",
        -30019 => "创建订单失败",
        -30020 => "订单信息不存在",
        -30021 => "完成订单失败",
        
        //后台相关
        
    );

    /**
     * 构造函数
     * @param array $res
     */
    public function __construct($res = array())
    {
        return $this->errcode;
    }
}
?>